# Вы можете расположить сценарий своей игры в этом файле.

# Определение персонажей игры.
define g = Character('Георгий', color="#b4befe")
define p = Character('Министр', color="#cba6f7")
define a = Character('Настя', color="#f38ba8")
define audio.g_voice1 = "audio/voice/g_voice1.opus"
image city = "city.png"
image fun = "fun.png"
# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

# Игра начинается здесь:
label start:
    show city
    with dissolve
    play music "ost/intro.ogg" volume 0.6 fadeout 2.0 fadein 2.0 loop

    """Давным давно, с двух сторон реки расположилось два города

    которые всю свою историю состязались между собой

    за статус самого инновационного города

    В один день, их борьба закончилась

    но это был не конец всей истории

    ведь теперь в проигравшем городе

    началась экологическая катастрофа:

    Вода сильно загрязнилась от новых заводов не следящими за своими отходами"""

    "и теперь"
    "ТЕБЕ"
    "нужно это решить"
    stop music fadeout 3.0

python:
    name = renpy.input("Как тебя зовут?")
    name = name.strip() or "Георгий"

label continue:
    with dissolve
    show fun
    play music "ost/ambient_2.ogg" volume 0.6 fadeout 2.0 fadein 2.0 loop
    g"Мне как-то Георгий будет ближе"

    """История повторяется, но теперь ставка куда выше — речь не про гонку технологий, а про выживание целого города.

    Недавно выборы изменили всё: новым депутатом стал... Я.

    Я ещё не знаю всех офисных коридоров наизусть, но уверен — время решительных действий настало.

    рабочий день начинается"""

    a"Георгий, поздравляю с назначением! Я — ваш помощник, и мы оба здесь новенькие. Город ждёт перемен… особенно с водой. Сегодня к вам приходят жители с жалобами, а министр экологии хочет поговорить"

    stop music fadeout 1.0

    play music "ost/phone.ogg" volume 0.1
    "раздается звонок"
    stop music fadeout 1.0

    play music "ost/ambient_1.ogg" volume 0.6 fadeout 2.0 fadein 2.0 loop

    "Неизвестныый""""Здраствуйте, Георгий. Знаю, вы только что приняли должность, но времени на раскачку нет — у нас экстренная ситуация.

    Ой извините забыл представиться я из Министерства Контроля Экологии"""

    p"""Вчера вечером наша лаборатория зафиксировала резкое превышение уровня нитратов и пестицидов в воде.

    Основной источник — сбросы от новых фермерских хозяйств, которые используют агрессивные химикаты без контроля.

    Часть из них прямо у реки и отходы стекают напрямую.

    Вода по анализам признана непригодной для питья и даже бытового использования. Уже поступили сообщения о случаях отравления — у людей проблемы с кожей, желудком, есть подозрения на массовое отравление детей.

    Нам пришлось ввести карантин в двух районах — жителям запрещено набирать воду из под крана, мы развозим бутилированную, но запасов хватит максимум на три дня.

    Прочти обращения: люди в панике, некоторые фермеры всё отрицают. Но реальный корень – отсутствие очистительных сооружений и беспорядочное использование пестицидов.

    Вот твои основные задачи:

    1. Провести встречи с фермерами и выяснить, какие препараты используются.

    2. Проверить отчёты предприятий по фильтрации и утилизации отходов.

    3. Решить, кого штрафовать, кого срочно обязывать установить очистку, а где нужно действовать экстренно — отправлять специальные бригады для очистки воды.

    У тебя три дня. Ситуация напряжённая, учитывая всё давление и… недовольство обычных жителей. До связи."""

    g"Хорошего дня"

    "звонок заканчиваеться"

    a"Вчера мне писала Мария из карантинной зоны — дети заболели, помощь не доезжает. С чего начнём, Георгий?"

    stop music fadeout 2.0

return
